# 坐标位置配置文件
# ============================================================================

# 屏幕坐标
# 配置 项链 戒指等单格
# CONFIG = {
#     # 词缀区域：现在支持直接填两个对角点 (点A, 点B)
#     # 系统会自动计算矩形范围，你可以填 (左上, 右下) 或者 (左下, 右上) 等任意对角
#     'affix_points': ((756, 638), (1053, 820)), 
    
#     # 洗炼按钮位置 (x, y)
#     'wash_button': (689, 865),
    
#     # 装备图标位置 (x, y)
#     'gear_pos': (905, 829)
# }
# 法杖
CONFIG = {
    # 词缀区域：现在支持直接填两个对角点 (点A, 点B)
    # 系统会自动计算矩形范围，你可以填 (左上, 右下) 或者 (左下, 右上) 等任意对角
    'affix_points': ((330, 464),  (566, 776)), 
    
    # 洗炼按钮位置 (x, y)
    'wash_button': (689, 865),
    
    # 装备图标位置 (x, y)
    'gear_pos': (429, 346)
}

# 是否使用硬编码配置（跳过向导）
USE_HARDCODED_CONFIG = True
